# pd.Series и pd.DataFrame

# Чтение CSV: pd.read_csv()

# Просмотр данных: .head(), .tail(), .info(), .describe()

# Выбор и фильтрация данных: df['col'], df[['col1','col2']], df[df['col'] > value]

# Группировка: df.groupby('col').mean()

In [1]:
import pandas as pd

In [20]:
df = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /piracydataset.csv')

In [19]:
df.head()

,Unnamed: 0,age,discordid,minecraftid,client,version
0,0,14.0,ProGamer300#3331,ProGamer300,Computer ( Java Edition ),Cracked
1,1,19.0,@shrey#4934,shrey_jain_,Computer ( Java Edition ),Cracked
2,2,18.0,Skullfaced#8657,Skullfaceddeath,Computer ( Java Edition ),Paid Version
3,3,17.0,Op DzGhOsT#8719,DzGHoST1737,Computer ( Java Edition ),Cracked
4,4,15.0,Dwijesh#6020,Dwijesh YT,Mobile ( bedrock version ),Paid Version

In [6]:
ser = pd.Series([10, 20, 30, 40])
ser

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
list = [1, 2, 3, 4]
ser = pd.Series(list)
ser

0    1
1    2
2    3
3    4
dtype: int64

In [22]:
df['Number of people(thousands)'] = ser ## I add Series in dataframe 
df

,Unnamed: 0,age,discordid,minecraftid,client,version,Number of people(thousands)
0,0,14.0,ProGamer300#3331,ProGamer300,Computer ( Java Edition ),Cracked,1.0
1,1,19.0,@shrey#4934,shrey_jain_,Computer ( Java Edition ),Cracked,2.0
2,2,18.0,Skullfaced#8657,Skullfaceddeath,Computer ( Java Edition ),Paid Version,3.0
3,3,17.0,Op DzGhOsT#8719,DzGHoST1737,Computer ( Java Edition ),Cracked,4.0
4,4,15.0,Dwijesh#6020,Dwijesh YT,Mobile ( bedrock version ),Paid Version,NaN
...,...,...,...,...,...,...,...
1418,1418,17.0,Savager,Asmitraj11,Computer ( Java Edition ),Cracked,NaN
1419,1419,15.0,( @KAMALTHESUPERBOY #6357),kamal1112,Computer ( Java Edition ),Cracked,NaN
1420,1420,17.0,ATHARVA#9034,SPIDEY_2,Computer ( Java Edition ),Cracked,NaN
1421,1421,15.0,GOD_RANVEER#3462,GOD_RANVEER,Computer ( Java Edition ),Cracked,NaN
1422,1422,14.0,ToughGamer2121#9555,Prachetan2008,Computer ( Java Edition ),Cracked,NaN

In [23]:
df.head(10) # shows the first few rows of the DataFrame.

,Unnamed: 0,age,discordid,minecraftid,client,version,Number of people(thousands)
0,0,14.0,ProGamer300#3331,ProGamer300,Computer ( Java Edition ),Cracked,1.0
1,1,19.0,@shrey#4934,shrey_jain_,Computer ( Java Edition ),Cracked,2.0
2,2,18.0,Skullfaced#8657,Skullfaceddeath,Computer ( Java Edition ),Paid Version,3.0
3,3,17.0,Op DzGhOsT#8719,DzGHoST1737,Computer ( Java Edition ),Cracked,4.0
4,4,15.0,Dwijesh#6020,Dwijesh YT,Mobile ( bedrock version ),Paid Version,NaN
5,5,15.0,KillerBunnyYP#8577,KillerBunnyYP,Computer ( Java Edition ),Cracked,NaN
6,6,20.0,@Ritzvish8842,Ritzvish,Computer ( Java Edition ),Cracked,NaN
7,7,16.0,@'-HøŇəýØp ᵇᵃᵛˡᵃ#0069,HoNeyOp,Computer ( Java Edition ),Cracked,NaN
8,8,21.0,LAPOGY#1515,LAPOGY,Computer ( Java Edition ),Paid Version,NaN
9,9,17.0,Magestic Plan #2063,Magestic,Computer ( Java Edition ),Cracked,NaN

In [25]:
df.tail(1) # Shows the last few rows of the DataFrame

,Unnamed: 0,age,discordid,minecraftid,client,version,Number of people(thousands)
1422,1422,14.0,ToughGamer2121#9555,Prachetan2008,Computer ( Java Edition ),Cracked,NaN

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1423 entries, 0 to 1422
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Unnamed: 0                   1423 non-null   int64
 1   age                          1422 non-null   float64
 2   discordid                    1423 non-null   object
 3   minecraftid                  1423 non-null   object
 4   client                       1423 non-null   object
 5   version                      1423 non-null   object
 6   Number of people(thousands)  4 non-null      float64
dtypes: float64(2), int64(1), object(4)
memory usage: 77.9+ KB

In [59]:
df.describe()

        Unnamed: 0          age  Number of people(thousands)
count  1423.000000  1422.000000                     4.000000
mean    711.000000    16.740506                     2.500000
std     410.929029     3.764837                     1.290994
min       0.000000     1.000000                     1.000000
25%     355.500000    15.000000                     1.750000
50%     711.000000    16.000000                     2.500000
75%    1066.500000    18.000000                     3.250000
max    1422.000000    43.000000                     4.000000

In [58]:
df.head()

,Unnamed: 0,age,discordid,minecraftid,client,version,Number of people(thousands)
0,0,14.0,ProGamer300#3331,ProGamer300,Computer ( Java Edition ),Cracked,1.0
1,1,19.0,@shrey#4934,shrey_jain_,Computer ( Java Edition ),Cracked,2.0
2,2,18.0,Skullfaced#8657,Skullfaceddeath,Computer ( Java Edition ),Paid Version,3.0
3,3,17.0,Op DzGhOsT#8719,DzGHoST1737,Computer ( Java Edition ),Cracked,4.0
4,4,15.0,Dwijesh#6020,Dwijesh YT,Mobile ( bedrock version ),Paid Version,NaN

In [72]:
col = df.loc[
    (df['age'] == 14) &
    (df['version'] ==  "Paid Version")
]
col[['age', 'version']].head(10)

      age       version
81   14.0  Paid Version
130  14.0  Paid Version
157  14.0  Paid Version
191  14.0  Paid Version
276  14.0  Paid Version
277  14.0  Paid Version
432  14.0  Paid Version
482  14.0  Paid Version
573  14.0  Paid Version
643  14.0  Paid Version

In [73]:
certain_columns = df[['age', 'client']]
certain_columns

       age                      client
0     14.0   Computer ( Java Edition )
1     19.0   Computer ( Java Edition )
2     18.0   Computer ( Java Edition )
3     17.0   Computer ( Java Edition )
4     15.0  Mobile ( bedrock version )
...    ...                         ...
1418  17.0   Computer ( Java Edition )
1419  15.0   Computer ( Java Edition )
1420  17.0   Computer ( Java Edition )
1421  15.0   Computer ( Java Edition )
1422  14.0   Computer ( Java Edition )

[1423 rows x 2 columns]

In [91]:
co = df[ 
    (df['minecraftid'].str.startswith('R')) &
    (df['age'] > 20)
]

co.shape

(6, 7)

In [92]:
df[df['age'] > 20][['age', 'client']].head() # Select Specific Columns after Filtering

     age                     client
8   21.0  Computer ( Java Edition )
10  21.0  Computer ( Java Edition )
12  21.0  Computer ( Java Edition )
13  26.0  Computer ( Java Edition )
20  21.0  Computer ( Java Edition )

# df.groupby('col').mean()

In [99]:
df2 = pd.DataFrame({
    'Team': ['A', 'B', 'A', 'B', 'A'],
    'Player': ['Alice','Bob','Charlie','David','Eva'],
    'Score': [10, 20, 30, 40, 50]
})
df2

  Team   Player  Score
0    A    Alice     10
1    B      Bob     20
2    A  Charlie     30
3    B    David     40
4    A      Eva     50

In [117]:
team_mean = df2.groupby('Team')['Score'].min()
print(team_mean)

Team
A    10
B    20
Name: Score, dtype: int64

In [119]:
team_mean = df2.groupby('Team')['Score'].mean()
print(team_mean)

Team
A    30.0
B    30.0
Name: Score, dtype: float64

In [121]:
team_mean = df2.groupby('Team')['Score'].count()
print(team_mean)

Team
A    3
B    2
Name: Score, dtype: int64

In [123]:
team_mean = df2.groupby('Team')['Score'].sum()
print(team_mean)

Team
A    90
B    60
Name: Score, dtype: int64

# Practice

In [216]:
dat = {
    'Name': ['Алик', 'Марал', 'Данияр', 'Айдар', 'Сауле'],
    'Age': [16, 17, 17, 16, 17],
    'Marks': [85, 90, 78, 92, 88]
}
dat

{'Name': ['Алик', 'Марал', 'Данияр', 'Айдар', 'Сауле'],
 'Age': [16, 17, 17, 16, 17],
 'Marks': [85, 90, 78, 92, 88]}

In [217]:
df3 = pd.DataFrame(dat)
df3

     Name  Age  Marks
0    Алик   16     85
1   Марал   17     90
2  Данияр   17     78
3   Айдар   16     92
4   Сауле   17     88

In [136]:
cl = df3[df3['Marks'] > 80]
cl

    Name  Age  Marks
0   Алик   16     85
1  Марал   17     90
3  Айдар   16     92
4  Сауле   17     88

In [137]:
df3.describe()

             Age      Marks
count   5.000000   5.000000
mean   16.600000  86.600000
std     0.547723   5.458938
min    16.000000  78.000000
25%    16.000000  85.000000
50%    17.000000  88.000000
75%    17.000000  90.000000
max    17.000000  92.000000

In [138]:
df3.groupby('Age')['Marks'].mean()

Age
16    88.500000
17    85.333333
Name: Marks, dtype: float64

In [149]:
file = pd.read_csv('/Users/danialmendigali/jupyter-datascience/Pandas/data set /Titanic-Dataset.csv')

In [152]:
prt = pd.DataFrame(file)

In [153]:
prt.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [154]:
prt.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [163]:
prt.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [167]:
prt.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [196]:
cnt1 = (prt['Sex'] == 'male').sum()
cnt2 = (prt['Sex'] == 'female').sum()
(cnt1, cnt2)

(np.int64(577), np.int64(314))

In [203]:
prt.groupby('Sex')['Sex'].count()

Sex
female    314
male      577
Name: Sex, dtype: int64

# Part 2 
# Среднее (mean), медиана (median), мода (mode)

# Стандартное отклонение (std), дисперсия (var)

# Применить к DataFrame из практики выше

In [218]:
df3

     Name  Age  Marks
0    Алик   16     85
1   Марал   17     90
2  Данияр   17     78
3   Айдар   16     92
4   Сауле   17     88

In [210]:
num_mean = df3['Marks'].mean()
num_median = df3['Marks'].median()
num_mode = df3['Marks'].mode()
print(num_mean, num_median, num_mode)

86.6 88.0 0    78
1    85
2    88
3    90
4    92
Name: Marks, dtype: int64

In [219]:
var_num = df3['Marks'].var()
var_num

np.float64(29.8)

In [220]:
std_num = df3['Marks'].std()
std_num

np.float64(5.458937625582473)

In [229]:
avg_age = prt['Age'].mean()
float(avg_age)

29.69911764705882